src/cf/InformationRegisters/уатПользователиМобильногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатПользователиМобильногоПриложения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПутевыеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьМаршрутныеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗаявкиНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЧат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗаказыТакси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатПользователиМобильногоПриложения_ТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатПользователиМобильногоПриложения_ТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС или оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатПользователиМобильногоПриложения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если флПарольМодифицирован Тогда 
		ТекущийОбъект.Пароль = Пароль;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пароль = "заглушка";
		
	ОбновитьСписокТССервер();
	
	стрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	Элементы.ИспользоватьПутевыеЛисты.Доступность    = стрНастройкиМобильногоПриложения.useWaybills;
	Элементы.ИспользоватьМаршрутныеЛисты.Доступность = стрНастройкиМобильногоПриложения.useRouteLists;
	Элементы.ИспользоватьЗаявкиНаРемонт.Доступность  = стрНастройкиМобильногоПриложения.useOrdersForRepair;
	Элементы.ИспользоватьЗаказыТакси.Доступность     = стрНастройкиМобильногоПриложения.useTaxiOrders;
	Элементы.ИспользоватьЧат.Доступность             = стрНастройкиМобильногоПриложения.useChat;
	
	Если Запись.Логин = "" Тогда
		Если Элементы.ИспользоватьПутевыеЛисты.Доступность Тогда
			Запись.ИспользоватьПутевыеЛисты = стрНастройкиМобильногоПриложения.useWaybills;
		КонецЕсли;
		Если Элементы.ИспользоватьМаршрутныеЛисты.Доступность Тогда
			Запись.ИспользоватьМаршрутныеЛисты = стрНастройкиМобильногоПриложения.useRouteLists;
		КонецЕсли;
		Если Элементы.ИспользоватьЗаявкиНаРемонт.Доступность Тогда
			Запись.ИспользоватьЗаявкиНаРемонт = стрНастройкиМобильногоПриложения.useOrdersForRepair;
		КонецЕсли;
		Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
			И Элементы.ИспользоватьЗаказыТакси.Доступность Тогда
			Запись.ИспользоватьЗаказыТакси = стрНастройкиМобильногоПриложения.useTaxiOrders;
		КонецЕсли;
		Если Элементы.ИспользоватьЧат.Доступность Тогда
			Запись.ИспользоватьЧат = стрНастройкиМобильногоПриложения.useChat;
		КонецЕсли;
	КонецЕсли;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИспользоватьОблачныйВриантРаботы = ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.27.0", СистемнаяИнформация.ВерсияПриложения) < 0;
	Элементы.ГруппаQRКод.Видимость = ИспользоватьОблачныйВриантРаботы И стрНастройкиМобильногоПриложения.ВариантРаботыВебСервиса = "Облачный";
	ОбновитьQRКод();
	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьПользователиМобильногоПриложения_ТС(ТекущийОбъект.Пользователь);
	уатМобильноеПриложениеВодителяСервер.ОбновлениеПользователейМобильногоПриложения();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	НомерСтроки = 1;
	Для Каждого ТекСтрока Из РазрешенныеТС Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ТС) Тогда
			ТекстНСТР = НСтр("ru = 'Не заполнена колонка ""Транспортное средство"" в строке %1 списка ""Разрешенные ТС""'; en = 'The ""Vehicle"" column in line %1 of the ""Permitted Vehicles"" list is not filled in.'");
			ТекстСообщения = СтрШаблон(ТекстНСТР, НомерСтроки);
			уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,"РазрешенныеТС",НомерСтроки, "ТС", Отказ);
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПутевыеЛистыПриИзменении(Элемент)
	Если (Запись.ИспользоватьПутевыеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьПутевыеЛисты.Доступность)
		И (Запись.ИспользоватьМаршрутныеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьМаршрутныеЛисты.Доступность)
		И (Запись.ИспользоватьЗаявкиНаРемонт = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаявкиНаРемонт.Доступность)
		И (Запись.ИспользоватьЗаказыТакси = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаказыТакси.Доступность)
		И (Запись.ИспользоватьЧат = Ложь ИЛИ НЕ Элементы.ИспользоватьЧат.Доступность) Тогда
		Запись.ИспользоватьПутевыеЛисты = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаявкиНаРемонтПриИзменении(Элемент)
	Если (Запись.ИспользоватьПутевыеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьПутевыеЛисты.Доступность)
		И (Запись.ИспользоватьМаршрутныеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьМаршрутныеЛисты.Доступность)
		И (Запись.ИспользоватьЗаявкиНаРемонт = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаявкиНаРемонт.Доступность)
		И (Запись.ИспользоватьЗаказыТакси = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаказыТакси.Доступность)
		И (Запись.ИспользоватьЧат = Ложь ИЛИ НЕ Элементы.ИспользоватьЧат.Доступность) Тогда
		Запись.ИспользоватьЗаявкиНаРемонт = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказыТаксиПриИзменении(Элемент)
	Если (Запись.ИспользоватьПутевыеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьПутевыеЛисты.Доступность)
		И (Запись.ИспользоватьМаршрутныеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьМаршрутныеЛисты.Доступность)
		И (Запись.ИспользоватьЗаявкиНаРемонт = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаявкиНаРемонт.Доступность)
		И (Запись.ИспользоватьЗаказыТакси = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаказыТакси.Доступность)
		И (Запись.ИспользоватьЧат = Ложь ИЛИ НЕ Элементы.ИспользоватьЧат.Доступность) Тогда
		Запись.ИспользоватьЗаказыТакси = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЧатПриИзменении(Элемент)
	Если (Запись.ИспользоватьПутевыеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьПутевыеЛисты.Доступность)
		И (Запись.ИспользоватьМаршрутныеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьМаршрутныеЛисты.Доступность)
		И (Запись.ИспользоватьЗаявкиНаРемонт = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаявкиНаРемонт.Доступность)
		И (Запись.ИспользоватьЗаказыТакси = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаказыТакси.Доступность)
		И (Запись.ИспользоватьЧат = Ложь ИЛИ НЕ Элементы.ИспользоватьЧат.Доступность) Тогда
		Запись.ИспользоватьЧат = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМаршрутныеЛистыПриИзменении(Элемент)
	Если (Запись.ИспользоватьПутевыеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьПутевыеЛисты.Доступность)
		И (Запись.ИспользоватьМаршрутныеЛисты = Ложь ИЛИ НЕ Элементы.ИспользоватьМаршрутныеЛисты.Доступность)
		И (Запись.ИспользоватьЗаявкиНаРемонт = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаявкиНаРемонт.Доступность)
		И (Запись.ИспользоватьЗаказыТакси = Ложь ИЛИ НЕ Элементы.ИспользоватьЗаказыТакси.Доступность)
		И (Запись.ИспользоватьЧат = Ложь ИЛИ НЕ Элементы.ИспользоватьЧат.Доступность) Тогда
		Запись.ИспользоватьМаршрутныеЛисты = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	флПарольМодифицирован = Истина;
	ОбновитьQRКод();
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	ОбновитьQRКод();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ОбновитьСписокТССервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокТС(Команда)
	ОбновитьСписокТССервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокТССервер()
	
	РазрешенныеТС.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Пользователь", Запись.Пользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатПользователиМобильногоПриложения_ТС.ТС КАК ТС
	               |ИЗ
	               |	РегистрСведений.уатПользователиМобильногоПриложения_ТС КАК уатПользователиМобильногоПриложения_ТС
	               |ГДЕ
	               |	уатПользователиМобильногоПриложения_ТС.Пользователь = &Пользователь";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РазрешенныеТС.Добавить();
		НоваяСтрока.ТС = Выборка.ТС;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПользователиМобильногоПриложения_ТС(Пользователь)
	
	ПользователиМобильногоПриложения = РегистрыСведений.уатПользователиМобильногоПриложения_ТС.СоздатьНаборЗаписей();
	ПользователиМобильногоПриложения.Отбор.Пользователь.Установить(Пользователь);
	ПользователиМобильногоПриложения.Прочитать();

	Если ПользователиМобильногоПриложения.Количество() <> 0 Тогда
		ПользователиМобильногоПриложения.Очистить();
	КонецЕсли;

	МассивТС = Новый Массив();
	Для Каждого ТекСтрока Из РазрешенныеТС Цикл
		Если МассивТС.Найти(ТекСтрока.ТС) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = ПользователиМобильногоПриложения.Добавить();
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.ТС			 = ТекСтрока.ТС;
		
		МассивТС.Добавить(ТекСтрока.ТС);
	КонецЦикла;
	
	Попытка
		ПользователиМобильногоПриложения.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ОбновитьQRКод()
	Если НЕ Элементы.ГруппаQRКод.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	стрНастройкиМобильногоПриложения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиМобильногоПриложения();
	
	ДанныеQRКода = СтрШаблон("https://play.google.com/store/apps/details?id=ru.rarus.uatdriver&ApiKey=%1&login=%2&pass=%3",
	стрНастройкиМобильногоПриложения.ApiKey, Запись.Логин, Запись.Пароль);
	ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(ДанныеQRКода, 0, 200);
	Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
		QRкод = ПоместитьВоВременноеХранилище(Новый Картинка(ДанныеQRКода), Новый УникальныйИдентификатор); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция СкопироватьКартинкуВБуферОбмена(Картинка)
	
	ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Картинка;
	Возврат ПоместитьВБуфераОбмена(Новый ЭлементБуфераОбмена(ФорматДанных, Картинка));
	
КонецФункции

&НаКлиенте
Асинх Функция ПоместитьВБуфераОбмена(Данные)
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		
		Если ТипЗнч(Данные) = Тип("ЭлементБуфераОбмена") Тогда
			ПомещаемыеДанные = Новый Массив;
			ПомещаемыеДанные.Добавить(Данные);
		Иначе
			ПомещаемыеДанные = Данные;
		КонецЕсли;
		
		Для Каждого ТекущиеДанные Из ПомещаемыеДанные Цикл
			
			Если НЕ Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ТекущиеДанные.ФорматДанных) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(ПомещаемыеДанные);
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Асинх Процедура СкопироватьКаритку(Команда) 
	Попытка
		Картинка = ПолучитьИзВременногоХранилища(QRкод);
		Ждать СкопироватьКартинкуВБуферОбмена(Картинка);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Успешно'; en = 'Successfully'"),
		, НСтр("ru = 'QR-код скопирован в буфер обмена'; en = 'The QR code has been copied to the clipboard.'"));
	Исключение 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Возникла ошибка при копировании в буфер обмена'; en = 'An error occurred while copying to the clipboard.'"));
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
